{
    "id": 1,
    "title": "The Lost Village",
    "excerpt": "María discovers an abandoned village in the mountains that holds an ancient secret.",
    "image": "/api/placeholder/400/300",
    "tags": {
        "level": "intermediate",
        "grammar": ["past-tense", "conditionals"],
        "content": ["adventure", "mystery"]
    },
    "content": "<p>María had alway been fascinated by the mountains surrounding her hometown. One sunny morning, she decided to explore a trail she had never taken before.</p>\n\n<p>As she hiked higher, the path grew narrower and less defined. If she had brought a better map, she would have realized she was heading toward an area that locals rarely visited. The air grew cooler as the trees thickened around her.</p>\n\n<p>After three hours of hiking, María crested a ridge and gasped. Below her lay a small village of stone houses, completely abandoned. Roofs had collapsed on some buildings, while others stood eerily intact. Nature had begun to reclaim the streets, with wildflowers pushing through the cobblestones.</p>\n\n<p>\"This is incredible,\" she whispered to herself. \"Why isn't this place on any tourist maps?\"</p>\n\n<p>María carefully made her way down to the village. The houses were built in an ancient style she didn't recognize, with strange symbols carved above each doorway. She photographed everything, noting how the buildings formed a perfect circle around a central well.</p>\n\n<p>When she approached the well, she noticed it was completely dry, with a spiral staircase leading down into darkness. If someone had told her about this place, she wouldn't have believed them. Now she stood at the edge, wondering what secrets lay below.</p>\n\n<p>As the sun began to set, María reluctantly turned back. She would return tomorrow with better equipment to explore further. The village had been abandoned for decades, perhaps centuries, but its mystery called to her. What had happened here? Why had everyone left? And what might be waiting at the bottom of that well?</p>\n\n<p>If she had looked more carefully at the symbol above the largest house, she might have understood the warning it contained. But that discovery would have to wait for another day...</p>"
}
